HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxVadc_reg.h
/** \\brief  1C88, Channel Assignment Register, Group */
#define VADC_G6_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021C88u)

/** Alias (User Manual Name) for VADC_G6_CHASS.
* To use register names with standard convension, please use VADC_G6_CHASS.
*/
#define	VADC_G6CHASS	(VADC_G6_CHASS)

/** \\brief  1E00, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E00u)

/** Alias (User Manual Name) for VADC_G6_CHCTR0.
* To use register names with standard convension, please use VADC_G6_CHCTR0.
*/
#define	VADC_G6CHCTR0	(VADC_G6_CHCTR0)

/** \\brief  1E04, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E04u)

/** Alias (User Manual Name) for VADC_G6_CHCTR1.
* To use register names with standard convension, please use VADC_G6_CHCTR1.
*/
#define	VADC_G6CHCTR1	(VADC_G6_CHCTR1)







/** \\brief  1E08, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E08u)

/** Alias (User Manual Name) for VADC_G6_CHCTR2.
* To use register names with standard convension, please use VADC_G6_CHCTR2.
*/
#define	VADC_G6CHCTR2	(VADC_G6_CHCTR2)

/** \\brief  1E0C, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E0Cu)

/** Alias (User Manual Name) for VADC_G6_CHCTR3.
* To use register names with standard convension, please use VADC_G6_CHCTR3.
*/
#define	VADC_G6CHCTR3	(VADC_G6_CHCTR3)

/** \\brief  1E10, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E10u)

/** Alias (User Manual Name) for VADC_G6_CHCTR4.
* To use register names with standard convension, please use VADC_G6_CHCTR4.
*/
#define	VADC_G6CHCTR4	(VADC_G6_CHCTR4)

/** \\brief  1E14, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E14u)

/** Alias (User Manual Name) for VADC_G6_CHCTR5.
* To use register names with standard convension, please use VADC_G6_CHCTR5.
*/
#define	VADC_G6CHCTR5	(VADC_G6_CHCTR5)

/** \\brief  1E18, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E18u)

/** Alias (User Manual Name) for VADC_G6_CHCTR6.
* To use register names with standard convension, please use VADC_G6_CHCTR6.
*/
#define	VADC_G6CHCTR6	(VADC_G6_CHCTR6)

/** \\brief  1E1C, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E1Cu)

/** Alias (User Manual Name) for VADC_G6_CHCTR7.
* To use register names with standard convension, please use VADC_G6_CHCTR7.
*/
#define	VADC_G6CHCTR7	(VADC_G6_CHCTR7)



/** \\brief  1DF0, External Multiplexer Control Register, Group x */
#define VADC_G6_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF0021DF0u)

/** Alias (User Manual Name) for VADC_G6_EMUXCTR.
* To use register names with standard convension, please use VADC_G6_EMUXCTR.
*/
#define	VADC_G6EMUXCTR	(VADC_G6_EMUXCTR)

/** \\brief  1CA0, Input Class Register */
#define VADC_G6_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0021CA0u)

/** Alias (User Manual Name) for VADC_G6_ICLASS0.
* To use register names with standard convension, please use VADC_G6_ICLASS0.
*/
#define	VADC_G6ICLASS0	(VADC_G6_ICLASS0)

/** \\brief  1CA4, Input Class Register */
#define VADC_G6_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0021CA4u)

/** Alias (User Manual Name) for VADC_G6_ICLASS1.
* To use register names with standard convension, please use VADC_G6_ICLASS1.
*/
#define	VADC_G6ICLASS1	(VADC_G6_ICLASS1)

/** \\brief  1D0C, Queue 0 Register 0, Group */
#define VADC_G6_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF0021D0Cu)

/** Alias (User Manual Name) for VADC_G6_Q0R0.
* To use register names with standard convension, please use VADC_G6_Q0R0.
*/
#define	VADC_G6Q0R0	(VADC_G6_Q0R0)

/** \\brief  1D10, Queue 0 Input Register, Group */
#define VADC_G6_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0021D10u)

/** Alias (User Manual Name) for VADC_G6_QBUR0.
* To use register names with standard convension, please use VADC_G6_QBUR0.
*/
#define	VADC_G6QBUR0	(VADC_G6_QBUR0)

/** \\brief  1D00, Queue 0 Source Control Register, Group */
#define VADC_G6_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0021D00u)

/** Alias (User Manual Name) for VADC_G6_QCTRL0.
* To use register names with standard convension, please use VADC_G6_QCTRL0.
*/
#define	VADC_G6QCTRL0	(VADC_G6_QCTRL0)

/** \\brief  1D10, Queue 0 Input Register, Group */
#define VADC_G6_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0021D10u)

/** Alias (User Manual Name) for VADC_G6_QINR0.
* To use register names with standard convension, please use VADC_G6_QINR0.
*/
#define	VADC_G6QINR0	(VADC_G6_QINR0)

/** \\brief  1D04, Queue 0 Mode Register, Group */
#define VADC_G6_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0021D04u)

/** Alias (User Manual Name) for VADC_G6_QMR0.
* To use register names with standard convension, please use VADC_G6_QMR0.
*/
#define	VADC_G6QMR0	(VADC_G6_QMR0)

/** \\brief  1D08, Queue 0 Status Register, Group */
#define VADC_G6_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0021D08u)

/** Alias (User Manual Name) for VADC_G6_QSR0.
* To use register names with standard convension, please use VADC_G6_QSR0.
*/
#define	VADC_G6QSR0	(VADC_G6_QSR0)

/** \\brief  1E80, Group Result Control Reg. */
#define VADC_G6_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E80u)

/** Alias (User Manual Name) for VADC_G6_RCR0.
* To use register names with standard convension, please use VADC_G6_RCR0.
*/
#define	VADC_G6RCR0	(VADC_G6_RCR0)

/** \\brief  1E84, Group Result Control Reg. */
#define VADC_G6_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E84u)

/** Alias (User Manual Name) for VADC_G6_RCR1.
* To use register names with standard convension, please use VADC_G6_RCR1.
*/
#define	VADC_G6RCR1	(VADC_G6_RCR1)

/** \\brief  1EA8, Group Result Control Reg. */
#define VADC_G6_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EA8u)

/** Alias (User Manual Name) for VADC_G6_RCR10.
* To use register names with standard convension, please use VADC_G6_RCR10.
*/
#define	VADC_G6RCR10	(VADC_G6_RCR10)

/** \\brief  1EAC, Group Result Control Reg. */
#define VADC_G6_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EACu)

